Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties
Serialization structure for  ModelModalAnalysisProperties.

Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties._AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties._ModalAnalysisModel
This indicates whether a modal analysis model is used.

Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties._ModalAnalysisModeCount
The modal analysis mode count.

Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties._ModalAnalysisMaxFrequency
The modal analysis maximum frequenct.

Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties._ModalAnalysisIncludeSelfWeightMass
This indicates whether selfweight mass is included in the modal analysis.

Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties._NumberOfModalAnalysisMassLoadGroupIds
The number of mass load group indentifier of the modal analysis.

Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties._ModalAnalysisMassLoadGroupIds
The mass load group indentifier of the modal analysis.

Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties._NumberOfModalAnalysisMassLoadGroupFactors
The number of mass load group factors of the modal analysis.

Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties._ModalAnalysisMassLoadGroupFactors
The mass load group factors of the modal analysis.

Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties._NumberOfModalAnalysisMassLoadGroupDirections
The number of mass load group directions of the modal analysis.

Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties._ModalAnalysisMassLoadGroupDirections
The mass load group directions of the modal analysis.

Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties.ToStruct(Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties.FromStruct(Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties)
DO NOT USE! For internal usage only!
P: P.